NextFOAM-2404/tutorials/combustion/reactingFoam/RAS/chokedNozzle/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -1 -2 0 0 0 0 ];

internalField   uniform 250000;

boundaryField
{
    inletair
    {
        type            zeroGradient;
    }

    outlet
    {
        type            outletMachNumberPressure;
        pBack           101325;
        choked          true;
        relax           0.1;
        M               0.3;
        value           $internalField;
    }

    walls
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
